In [27]:
import pandas as pd
names=pd.read_csv("girls_name.csv", usecols=['Names'])
names

      Names
0      sara
1      noor
2      iqra
3      aqsa
4     maria
5     kiran
6     zobia
7   nosheen
8     farha
9      zara
10    kokab
11    faiza
12     sara

In [37]:
names.sort_values(by=['Names'],inplace=False)
names.head()

    Names
3    aqsa
11  faiza
8   farha
2    iqra
5   kiran